Repository: JianLaiTL/JianLai
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 刘羡阳带着美丽妇人走向小溪，语气坚定道：“夫人，你如果是想要说服我，卖给你们那件传家宝，我劝夫人不要开这个口了。”
en_us: Liu Xianyang walked toward the creek with the beautiful woman, and he said in a firm voice, "Ma'am, if you're trying to convince me to sell my family heirloom to you, I suggest that you give up."

source: 刘羡阳当时觉得此举颇有意义，便让陈平安帮他把那么大块石子扛回家，结果到了小镇上，没个定性的高大少年又觉得没劲，就让陈平安自己解决掉石头，陈平安那次刚走进泥瓶巷，就发现隔壁稚圭莫名其妙跟在自己身后，也不说话，一直死死盯着他怀里那块石头，眼神就跟陈平安每次瞧见杏花巷贩卖的肉包差不多，陈平安实在扛不住她的眼馋，就将石头送给了她，结果她一开始还搬不动，差点砸了脚，陈平安又只好干脆搬到宋集薪家的院子里去，至于之后石头的最终下落，陈平安便不得而知了。
en_us: At the time, Liu Xianyang had felt like he had accomplished something great, so he had asked Chen Ping'an to help him carry the large pebble back home. After arriving back in town, however, the tall and broad boy who always changed his mind had felt like this was boring, so he had told Chen Ping'an to deal with the large pebble himself. Immediately after arriving on Clay Vase Alley, he had discovered his neighbor Zhi Gui following behind him. She had remained silent, yet her eyes had been intently fixed on the large snake gall pebble in his hands. In fact, her expression had been like Chen Ping'an's expression when he looked at the meat buns being sold in Apricot Blossom Alley. Unable to withstand her intense gaze, Chen Ping'an had ultimately chosen to give the pebble to her. However, she had been unable to carry it, and she had almost dropped it on her feet. Thus, Chen Ping'an had decided to carry it to Song Jixin's courtyard for her. As for where this pebble was now, Chen Ping'an had no idea at all.

source: 刘羡阳很快背着一只箩筐跑回来，陈平安正在水井旁边观看凿井运土的情景，刘羡阳对着陈平安屁股就是一脚，踹得草鞋少年差点一个狗吃屎，回头瞧见是高大少年后，便没计较。刘羡阳大大咧咧道：“事情成了，阮师傅说让我这些天，老老实实在这边别乱跑，白天挖井，晚上打铁，一旬半之后，我就算他在小镇这边的第一个徒弟，叫啥开山弟子来着。我给你弄了个箩筐过来，帮你摸石头去，从铁匠铺这边摸上去，摸到廊桥那边为止，事先说好，青牛背那个地方的水坑，我是帮不了你的忙了，阮师傅说我这些天敢跨过廊桥以北、以西两个地方半步，就打断我的腿。”
en_us: After short while, Liu Xianyang ran back over with a bamboo basket on his back. Chen Ping'an was watching the workers digging the wells, yet he almost faceplanted into the ground when Liu Xianyang over and kicked him in the rear. Glancing back and realizing that it was Liu Xianyang, Chen Ping'an decided not to make a fuss about this. Liu Xianyang casually said, "It's all done now. Master Ruan told me to stay put and not run around for the next few days. I'll be diggin wells in the morning and forging iron at night. After two weeks or so, I'll become his first disciple in this small town. What was it called again? The opening disciple or something. I also found a bamboo basket for you, and I can use it to help you collect those pebbles. We can start from the blacksmith forge and work our way up to the covered bridge. Let me say this first though. I can't help you when we get to the pit at the Azure Cow Ridge. Master Ruan said that he'll break my legs if I dare to venture north or west of the covered bridge these few days."

source: 刘羡阳得不到答案，也就没了兴致。
en_us: Liu Xianyang received no response, and this quickly dampened his interest in the topic.

source: 刘羡阳得意洋洋道：“我家阮师傅出了小镇后，在南边那条溪边上，突然就说要挖几口井，原先人手不够，需要喊人帮忙，我就随口提了提你，说有个矮冬瓜，气力还凑合。阮师傅也答应了，让你这两天就自己过去。”
en_us: A smug look appeared on Liu Xianyang's face as he continued, "While Master Ruan was out of town and passing by the creek to the south, he suddenly told me that he wanted to dig a few wells. He doesn't have enough people for the job and wants some more help, so I mentioned you to him on a whim. I told him that I know a short kid who has some decent strength, and Master Ruan agreed. He wants you to go and see him in the next couple of days.

source: 刘羡阳心不在焉道：“急啥，我这种既手脚利索又吃苦耐劳的学徒，打着灯笼也难找，阮师傅就是放狠话，明儿再去也没关系。”
en_us: Liu Xianyang was absent-minded as he replied, "What's the hurry? Where else is he going to find a disciple as skilled and hard-working as me? Master Ruan is merely making some empty threats. It'll be fine even if I go tomorrow."

source: 刘羡阳忙着擦拭宝甲，时不时低头呵口气，直接用手臂轻轻摩挲，已经真正乐在其中了。
en_us: Liu Xianyang was busy scrubbing the suit of armor, and from time to time, he would lean down and breath onto it before directly using his forearm to wipe it clean. He was already engrossed in this task.

source: 刘羡阳忧心忡忡道：“宋集薪这种小白脸，是绝对争不过我的，可是万一稚圭喜欢上这位气度不凡的官老爷，我胜算就不大了啊！到时候你的未来嫂子就跟人跑了，我咋办？你也咋办？”
en_us: Liu Xianyang was riddled with anxiety as he said, "There's no way that a pretty boy like him can defeat me. However, what if Zhi Gui falls for this impressive official? I won't stand much chance against him! At that time, your future sister-in-law will run away with someone else! What will I do? And what will you do?"

source: 刘羡阳急忙举起双手，坚决不让陈平安继续絮叨下去，狡猾道：“我不说了，行了吧陈平安你这认死理的烂脾气，随谁呢我爷爷可说过，你爹娘都很好说话的，尤其是你娘亲，说话细声细气的，还喜欢笑，那脾气好得真是没话说，我爷爷还说早年马婆婆，几乎骂遍了附近巷弄的人，唯独见着你娘亲，非但不挑刺，还会有些笑脸呢。”
en_us: Liu Xianyang hurriedly raised his hands, refusing to listen to Chen Ping'an's lecture. He wore a sly smile as he said, "I'll stop slandering him, okay? Chen Ping'an, who did you learn this stubborness and inflexibility from? After all, my grandpa said that your father and mother were both very amiable people, especially your mother. Her voice was always soft and gentle, and she also liked to smile all the time. Her temper was truly as good as could be. My grandpa also said that Granny Ma would curse almost everyone when she was young, yet she would always make an exception when it came to your mother. Not only did Granny Ma not curse her, but she would even smile at her."

source: 刘羡阳恼羞成怒道：“你知道什么好什么坏？”
en_us: Liu Xianyang was furious to hear this. "How would you know? You don't even know the diffference between good and bad!"

source: 刘羡阳想了想，“我会跟她一起离开，去一个据说比咱们东宝瓶洲还要大的地方。”
en_us: Liu Xianyang thought for a moment before telling Chen Ping'an, "I'm going to leave with her. I'm going to go to a place that's apparently even larger than the Eastern Treasured Vial Continent."

source: 刘羡阳想了想，没有说话。
en_us: Liu Xianyang pondered for a moment before choosing to remain silent.

source: 刘羡阳想着阮师傅私下传授的那几个拳架子，就开始练习起来，倒也有模有样，虎虎生风。
en_us: Liu Xianyang thought back to the handful of fist techniques that Master Ruan had taught to him in private, and he began to practice them, looking very much like he was cut out for the part.

source: 刘羡阳打断卢家公子的话语，“还来？好狗不挡道，给老子起开！”
en_us: Liu Xianyang cut him off saying, "Again? Obedient dogs don't block their owner's path. Now, piss off!"

source: 刘羡阳扯了扯嘴角，“其实我连东宝瓶洲是个啥也不晓得。”
en_us: He pursed his lips and said, "To tell you the truth, I don't even know what the Eastern Treasured Vial Continent is."

source: 刘羡阳把陈平安拉扯到门槛外，用手肘顶了一下少年，“咋回事？”
en_us: Liu Xianyang dragged Chen Ping'an to the door, elbowing him and asking, "What's going on?"

source: 刘羡阳拆台道：“小镇以外的我不知道，我只知道在小镇上，姓陈的只有小猫小狗三两只，而且除了你之外，好像全是那四姓十族的家生子，世世代代的奴婢身份，好笑的是，这些人在宅子里头当做牛马，低头哈腰，可只要出了那些大宅子，见到所有人就立即换了面孔，最喜欢狗眼看人低。所以姚老头说得对，要是你陈平安哪天也去给他们当下人，那你们这一支没有迁出小镇的陈氏，就算全军覆没喽。”
en_us: "I don't know about the outside, but I know that there are only a few cats and dogs with the surname Chen in our small town," Liu Xianyang replied. "Apart from you, the other members of the Chen Clan are all servants for the Four Surnames and Ten Clans. This is the case for generation after generation. What's funny, however, is that these people are always bowing and humbling themselves before their masters, yet when they head out and see other people, they immediately put on a different expression and act as if they're superior. So, Old Man Yao was correct. If you also went and became their servant, then this branch of the Chen Clan that stayed in the small town could be considered completely finished."

source: 刘羡阳拍了拍陈平安的肩膀，语重心长道：“就当你答应了。”
en_us: Liu Xianyang patted Chen Ping'an's shoulder and said in a meaningful voice, "I'll take that as a yes."

source: 刘羡阳挠挠头，站起身，也没说什么愧疚言语，只是轻轻踹了一脚陈平安，咧嘴笑道：“行了，不就一张小破床嘛，我今天来，就是给你带一个天大的好消息，怎么都比你这破床值钱！”
en_us: Liu Xianyang scratched his head as he stood up, and he didn't apologize or express any guilt. Instead, he gave Chen Ping'an a playful kick as he grinned and said, "Get over it, it's just a crappy little bed. I'm here today to deliver a massive piece of good news to you, one that's way more valuable than this crappy bed!"

source: 刘羡阳挤出一个笑脸，沙哑道：“叫陈对的女人找过你了？”
en_us: He squeezed out a smile and asked in a hoarse voice, "That Chen Dui woman spoke to you already?"

source: 刘羡阳挥手赶人，“赶紧给你家小媳妇炖汤去。”
en_us: Liu Xianyang waved his hand to shoo him away. "Hurry up and bring the soup to your wife."

source: 刘羡阳挥手道：“你在这等着，我去跟阮师傅打招呼去，看能不能带你见识见识打铁的光景，啧啧，你要是看到他闺女抡捶打铁的模样，我保证能吓死你！”
en_us: Liu Xianyang waved his hand and said, "You can wait for me here. I'm going over to greet Master Ruan, and I'll see if I can bring you around to witness the sight of iron being forged. Tsk, tsk, I guarantee that you'll be frightened to death if you see his daughter swinging her hammer and forging iron!"

source: 刘羡阳接过箩筐，后退数步，毫无征兆地高高跳起，来了yi个花哨的回旋踢。
en_us: After accepting the basket, Liu Xianyang took several steps back before suddenly launching into the air and performing a flashy roundhouse kick.

source: 刘羡阳插了一句话，“这石头有一点比较古怪，只要拿出小溪之后，一旦风吹日晒，颜色就会变淡，尤其是下过雨雪之后，掉色掉得更厉害。除此之外，就没啥了。”
en_us: Liu Xianyang interrupted her at this moment, saying, "There's something strange about these pebbles. After removing them from the creek, they'll immediately lose their luster if they're subject to wind or sunshine. This is especially the case after bouts of rain or snow. They'll lose their luster at an incredible speed. Apart from this, there's nothing special about them."

source: 刘羡阳摇头道：“没有啊，倒是那个老喜欢偷瞄妇人的算命道人，跟我说了些晦气话，我差点把他的摊子都砸了。”
en_us: Liu Xianyang shook his head replying, "Nope! However, the Daoist fortune teller who likes to perve on women said some ill-omened things to me. I almost smashed his stall when I heard it."

source: 刘羡阳斜眼道：“那咱俩比比谁在水底憋气久？”
en_us: Liu Xianyang shot him a sideways glance and said, "Then let's see which of us can hold our breath for longer underwater?"

source: 刘羡阳无奈道：“不过你需要先回去，跟他们好好合计合计，商量出一个公道价格才行，别再糊弄我了，我又不是傻子，什么两百贯铜钱，且不说我会不会亏到姥姥家，只说那帮贵人不嫌掉价吗？”
en_us: Liu Xianyang's voice was filled with exasperation as he said, "However, you need to go home and have a serious meeting with those people first. You need to come up with a satisfactory offer and stop trying to fool me. After all, I'm not a fool. An offer of 200,000 copper coins? To say nothing of whether I'm being screwed over or not, don't those people feel like they're degrading themselves?"

source: 刘羡阳无奈道：“你怎么总想这么多没用的事情，没意思啊，难怪宋集薪说你就是鬼打墙的命，在这么个屁大的地方兜兜转转，一辈子都走不出去。”
en_us: Liu Xianyang was slightly exasperated as he said, "Why do you always think about all these useless things? How uninteresting! No wonder Song Jixin said that you're destined to be stuck here forever!"

source: 刘羡阳最受不了她这种视线，“干啥，不过是认识个管烧瓷的官老爷，了不起啊？”
en_us: Liu Xianyang couldn't stand it when she wore such an expression, and he said, "What? He's merely aquainted with the official responsible for overlooking the kilns. Is that so impressive?"

source: 刘羡阳最好面子，也只知道陈平安口风紧，就经常拿老姚的秘传口诀来震慑后者，例如“想要刀的线路走得稳，手就要不能是死板的稳，归根结底，是心稳。”
en_us: Liu Xianyang really liked to show off, and he knew that Chen Ping'an was very good at keeping secrets, so he often revealed pieces of Old Man Yao's secret mantras to Chen Ping'an to flaunt his knowledge. For example, in order to ensure the burin followed a stable path, one couldn't focus dogmatically on keeping one's hand steady. Ultimately, the key was to keep one's heart steady.

source: 刘羡阳有些惊讶，记得这道士以前给人解签算命，且不说准不准，但此人还真没有主动招徕过生意，几乎全部属于愿者上钩。难不成如今龙窑给朝廷官府关闭，这道士也要跟着倒霉，揭不开锅了，所以宁肯错杀不愿错放？刘羡阳笑骂道：“你的法门就是破财消灾，对不对？滚你大爷的，想从我兜里骗钱，下辈子吧！”
en_us: Liu Xianyang was rather surprised to hear this. He knew that this ist priest had always been telling people's fortunes based on the slips that they drew, and setting aside whether his fortune-telling was accurate or not, Liu Xianyang couldn't ever recall an instance where the ist priest had actively tried to rope in customers. Almost all of his customers had voluntarily gone to him. Could it be that with the closing of the dragon kilns, the ist priest's business was also impacted, and he was struggling to get by, thereby leading him to go after all potential customers with discretion? Liu Xianyang chuckled in disdain, "The way you're going to help me avert disaster is by having me give you money, right? Piss off! You're never getting a single copper coin out of my pocket!"

source: 刘羡阳有些愧疚，又不是那种做错事后愿意说“对不起”三个字的脾气，只得假装什么都没有发生，起身道：“走了走了，挖井去，对了，我再跟阮师傅磨一磨，争取让你来这边当个短工学徒，到时候想要摸石头也容易。”
en_us: Liu Xianyang felt a little guilty. However, he wasn't the type of person to apologize, so he could only pretend that nothing had happened. He stood up and said, "Alright, I'm leaving now, I need to go back to dig some wells. Oh, that's right, I'll annoy Master Ruan a bit more and try to have him hire you as a temporary apprentice. At that time, it'll also be much easier for you to collect these pebbles."

source: 刘羡阳有些手足无措。
en_us: Liu Xianyang was at a complete loss.

source: 刘羡阳有些纠结，吞吞吐吐道：“这不当时第一天去当学徒帮工，阮师傅看我的眼神，就跟姚老头那会儿差不多，估计是观察我一段时间再做决定，要不要收徒弟吧。只是”
en_us: Liu Xianyang was slightly unsure, and he slowly muttered, "On the first day I went to work as an apprentice, Master Ruan was looking at me with the same expression that Old Man Yao used to wear. He probably wanted to observe me for some time before making a decision on whether he wanted to take me as a disciple of not. It's just that..."

source: 刘羡阳松开手，蹲在溪边，随手摸了块石子丢入溪水，撇嘴道：“反正宝甲不是不能卖，现在既然有个公道价格，不也挺好，还能让事情变得更稳妥，说不定都不用宁姑娘冒险出手，所以我觉得不坏。”
en_us: Liu Xianyang let go of him and squatted down by the creek. As he casually picked up a pebble and tossed it into the water, he pursed his lips and said, "It's not like I definitely can't sell that suit of treasured armor. Since she's offering a fair price for it, isn't the outcome pretty good anyway? It can also make our situation safer, and perhaps Ning Yao won't need to interfere and put herself in danger either. So, I feel like this isn't a bad outcome."

source: 刘羡阳正坐在门槛上，竖起耳朵聆听那边的动静，唯恐被他听出点神仙打架的声响，心情正糟糕的高大少年不耐烦道：“你忙你的”
en_us: Liu Xianyang was sitting on the doorstep at this moment, with his ears pricked for any movement next door. He would immediately act if he heard any squeaking or rustling. He was in a terrible mood, and he snapped in impatience, "Yeah, go do what you need to."

source: 刘羡阳此时才发现陈平安在做一件古怪的勾当，蹲在门内，身体向外倾，用一截只剩下拇指大小的蜡烛，烧掉一张黄纸，灰烬都落在门槛外。貌似陈平安还念念有词，只是离得有些远，刘羡阳听得不真切。
en_us: Only now did he notice that Chen Ping'an was doing something rather strange. He was squatted down inside the doorstep with his body leaning forward, using a candle to burn a piece of yellow paper. Only around a thumb's length of the candle remained, and all of the ashes of burned piece of paper fell outside of the doorstep. It seemed that Chen Ping'an was also chanting something, but Liu Xianyang was too far away to hear what he was saying.

source: 刘羡阳歪了歪脑袋，讥讽道： “怎么，你给人牵线搭桥还上瘾了不是？我就奇了怪了，你说你卢正淳，好歹是咱们小镇最阔绰人家的孙子，咋就那么喜欢给外人当狗腿子？”
en_us: Liu Xianyang cocked his head and said with a sneer, "What, you've become addicted to the feeling of being someone else's puppet? Say, I find this quite strange. You, Lu Zhengchun, come from the wealthiest clan in town, yet you've taken a liking to running around as those outsider's lackey?"

source: 刘羡阳每次都听得咽口水，宋集薪偶尔也去，不会带着稚圭，笑得很比刘羡阳含蓄些，但跟着众人起偷偷起哄的时候，格外卖力，比早晚两次读圣贤书还要大声。
en_us: Liu Xianyang would always gulp when he hear gossip like this. Song Jixin would also occasionally hang out near the old locust tree, although he would never bring Zhi Gui along with him. His smile would also be more reserved than Liu Xianyang's. However, when he secretly hooted and heckled with the others, his voice would be even louder than when he recited the teachings of the Sages during morning and night.

source: 刘羡阳没好气道：“坟头长了一棵树，也值得大惊小怪的？再说了，那也是陈氏另外一支老祖宗的坟头，跟你陈平安没有半颗铜钱的关系！”
en_us: Liu Xianyang huffed and replied, "What's so incredible about a tree sprouting from a grave? In any case, that's the grave of another branch of the Chen Clan; it's got nothing to do with you, Chen Ping'an!"

source: 刘羡阳没来由觉得灰心丧气，跳下墙头对屋内嚷嚷道：“姓陈的，咱们去铁匠铺！不受这窝囊气了。”
en_us: Liu Xianyang couldn't help but feel dejected. He jumped down from the wall and shouted, "Chen Ping'an, let's go to the blacksmith! I'm not going to sit here and suffer in frustration!"

source: 刘羡阳点了点头，对卢正淳说道：“哥们，你还是先起来吧，起来说话！你他娘的这么整，算哪门子事！”
en_us: Liu Xianyang nodded in understanding. He turned around and said to Lu Zhengchun, "Brother, why don't you get up first. Stand up and talk! Fucking kowtowing like this... Just what the hell is this?!"

source: 刘羡阳点点头，“记得小心点。”
en_us: Liu Xianyang nodded and said, "You remember to be careful as well."

source: 刘羡阳烦躁道：“等会儿就去，别耽误我干正事。”
en_us: Liu Xianyang was extremely annoyed, and he said, "Alright, I'll head over in a little while. I'm doing something important now, so don't disturb me."

source: 刘羡阳热血上涌，连耳根子都通红了，走到黄泥墙边，一拳重重砸在墙头上，“王朱！有本事你再说一遍！”
en_us: Liu Xianyang boiled with anger, with even his ears becoming bright red. He walked up to the wall and punched it with ferocity, shouting, "Wang Zhu, I dare you to say that again!"

source: 刘羡阳犹豫片刻，破天荒微微脸红，“就像春天猫叫一样。”
en_us: Liu Xianyang hesitated momentarily, and in an extremely rare and uncharacteristic display of embarrassment, he blushed slightly as he continued, "Like how cats sound during spring?"

source: 刘羡阳环顾四周，墙角斜放着一根鱼竿，窗口躺着一副弹弓，墙壁上挂着木弓，高大少年欲言又止，最后还是忍住没开口。
en_us: Liu Xianyang looked around and noticed a fishing rod placed on a slant in the corner, a slingshot on the windowsill, and a wooden bow hanging on the wall. He was about to say something, but refrained from doing so in the end.

source: 刘羡阳理直气壮道：“你的钱，不就是我的钱吗？你想啊，我要是跟你借钱，你有脸皮催债要我还？”
en_us: "Isn't your money also my money?" Liu Xianyang said with righteousness. "Just think about it. If I borrowed money from you, would you have the heart to demand me to pay back?"

source: 刘羡阳痴痴点头道：“好的。”
en_us: Liu Xianyang was in a daze as he nodded and replied, "Okay."

source: 刘羡阳白眼道：“这有啥能不能的，但是你得答应我，帮我盯着稚圭，千万别让宋集薪那个小畜生强行糟蹋了，到时候你可得帮我保住我未来媳妇的清白！”
en_us: Liu Xianyang rolled his eyes. "Of course you can! However, you have to promise me that you'll keep an eye on Zhi Gui for me. You definitely can't let that brat Song Jixin forcefully defile her. You have to protect the chastity of my future wife!"

source: 刘羡阳目瞪口呆。
en_us: Liu Xianyang was stunned.

source: 刘羡阳看着身姿正在抽条、越来越明艳动人的少女，说不出话来，心里空落落的，就像心里一只瓷碗，摔在了地上。
en_us: Liu Xianyang was rendered speechless as he looked at the young girl who was becoming more slender and beautiful by the day. He felt completely empty inside, and it was as if something inside him had been shattered.

source: 刘羡阳看着陈平安将蜡烛吹灭，放在桌上，低声问道：“你平时清晨有没有听到过古怪的声响，就像”
en_us: Liu Xianyang watched as Chen Ping'an blew out the candle before setting it down on the table, then asked, "Have you heard any strange sounds in the morning? Like..."

source: 刘羡阳眼神呆滞。
en_us: Liu Xianyang was quite taken aback to hear this.

source: 刘羡阳眼角余光瞥见那隔壁丫鬟已经进了屋子，便一下子没了扮演英雄好汉的兴致，
en_us: Out of the corner of his eye, Liu Xianyang could see that Zhi Gui had already entered the neigboring house, and he immediately lost all interest in keeping up his heroic act.

source: 刘羡阳离开小巷，经过算命摊子的时候，那年轻道人招收道：“来来来，贫道看你气色如烈火烹油，绝非吉兆啊，不过莫怕便是，贫道有一法，可以帮你消灾”
en_us: After leaving the alley, Liu Xianyang was just passing by the fortune teller's stall when the young ist priest called out to him. "Come, young man! I can see that you have the complexion of a fire fueled by oil. That's definitely not a good omen! But do not fear, I have a way to help you avert disaster!"

source: 刘羡阳突然威胁道：“姓陈的，我家宅子你可以继续住着，可是别等我回去，你已经把我家的那具宝甲给卖了啊！”
en_us: Liu Xianyang suddenly warned, "Chen Ping'an! You can continue to stay at my place, but don't let me find out that you've already sold my suit of armor when I return!"

source: 刘羡阳突然怒道：“扯了这么多，你还没说到底看到啥！”
en_us: "You've babbled on about so much, yet you still haven't told me what you saw!" Liu Xianyang suddenly said in anger.

source: 刘羡阳突然笑了，“只是又一想，连死都死过了，还怕这个？”
en_us: Liu Xianyang suddenly laughed and mused, "However, when I think about it, I've already died once, so do I still need to be afraid of this?"

source: 刘羡阳突然转过身，面对门槛内的陈平安，高大少年一坐腰，脚不离地，直冲数步后，重重挥出一拳，然后收拳挺腰，大声笑道：“阮师傅私底下跟我说，这拳法我只需要练一年，就能打死人！”
en_us: He then crouched down into a low stance before shuffling a few steps toward Chen Ping'an, then threw a heavy punch in his direction. After that, he stood up straight again as he withdrew his fist and chortled, "Master Ruan told me in private that I'll only need to practice this fist technique for a year, and I'll be able to kill someone with a single punch!"

source: 刘羡阳站在摊子旁边，看着道人的狼狈身影，哈哈大笑，瞥见桌上的签筒，随意伸手将其推倒，竹签哗啦啦滑出签筒，最后在桌上呈现出扇形模样。
en_us: Liu Xianyang stood beside the stall, chortling with mirth at the sight of the ist priest's cowardly display. He then spotted the bamboo tube on the table and casually pushed it over. All of the bamboo slips inside were instantly tipped out, fanning themselves out across the table.

source: 刘羡阳站起身，踹了yi脚草鞋少年背后的箩筐，“赶紧的，我拿去还给阮师傅，回到等我正式拜师敬茶，你可以来长长见识。”
en_us: The tall boy stood up before kicking Chen Ping'an's bamboo basket and saying, "Hurry up, I need to return this to Master Ruan. When I officially become his disciple, I'll invite you over to broaden your horizons."

source: 刘羡阳站起身，问道：“要不要帮你背到廊桥那边？”
en_us: Liu Xianyang stood up and asked, "Do you want me to carry it to the covered bridge for you?"

source: 刘羡阳笑着使劲点头，嘴上说着好的好的，然后回头望向陈平安，指了指屋里少女，然后指了指自己脑袋。
en_us: Liu Xianyang smiled and nodded earnestly, agreeing with what the young woman said. He then turned around to face Chen Ping'an, pointing at the young woman before pointing at his own head.

source: 刘羡阳笑道：“你傻我又不傻。”
en_us: Liu Xianyang chuckled and replied, "You might be stupid, but I'm certainly not."

source: 刘羡阳笑问道：“如果不是因为我，你和宋集薪会不会成为很要好的朋友？”
en_us: Liu Xianyang smiled and asked, "If it weren't for me, would you and Song Jixin have become very good friends?"

source: 刘羡阳笑问道：“陈平安，那你觉得神仙也需要吃喝拉撒不？”
en_us: Liu Xianyang chuckled and asked, "Chen Ping'an, do you think that immortals also need to eat and shit?"

source: 刘羡阳等了半天，一直没等到下文，转头笑道：“没你这么拉屎拉一半，就提起裤裆的啊！”
en_us: Liu Xianyang waited for him to continue. Yet, after waiting for half a day, he still didn't hear another peep from Chen Ping'an. He turned around and said with a smile, "Just like taking a shit, who the hell pulls their pants up halfway? Are you going to continue or not?!"

source: 刘羡阳绞尽脑汁想出一些酸文醋字，结结巴巴道：“谢过督造官大人厚爱，不胜惶恐……只是小的已经答应要做阮师傅铁匠铺的学徒，实在不好反悔，还望大人不要……大人不计……”
en_us: Liu Xianyang wracked his brains in an attempt to come up with an intelligent-sounding response. In the end, however, he stammered as he said, "T-thank you for your kindness. But I'm a-afraid that... I can't accept b-because I've already agreed to become Master Ruan's d-disciple. I can't go back on my words. P-please don't... take note of this... of this..."

source: 刘羡阳翻了个白眼，不再对牛弹琴，双手撑在床板上，缓缓弯曲手肘，然后伸直手臂，屁股离开床板，双脚离开地面。他的屁股悬在空中，撇嘴讥讽道：“什么稚圭，分明是叫王朱，姓宋的从小就喜欢瞎显摆，不知道从哪里看到稚圭两个字，就胡乱用了，根本不管两个字的意思好不好。王朱摊上这么个公子，也真是上辈子作孽，否则不至于来宋集薪身边遭罪吃苦。”
en_us: Liu Xianyang rolled his eyes and didn't waste any more time discussing the subject with someone who was clearly completely oblivious to what he was talking about. He placed his palms down onto the bed plank, then bent his elbows slightly before straightening his arms, supporting his own weight with his hands so that his bottom lifted up from the plank and his feet were lifted up from the ground. He then pursed his lips as he sneered, "What kind of name is Zhi Gui supposed to be? Her name is clearly Wang Zhu. That little Song brat always liked to show off ever since he was a wee little pipsqueak. He probably just saw the characters Zhi Gui from somewhere and decided to use it on a whim without even considering whether that name has good implications or not. Wang Zhu had to have accumulated a ton of bad karma in her past life. Otherwise, she wouldn't have been reincarnated as Song Jixin's servant and been forced to lead such a miserable life."
